namespace Dishes

open Types
open System

open Products
open Operators

[<AutoOpen>]
module Soups =

    let soups =
        [ { name = "борщ"
          ; ingredients = 
            [ мясо 400
            ; свекла 1.0
            ; вода 1.0
            ; ``соли и переца по вкусу`` 
            ]
          ; recipe = 
                { steps = 
                    [ 60 -- "сварите мясной бульон"
                    ; 10 ++ "нарежте овощи" 
                    ]
                }
          }
        ; { name = "харчо"
          ; ingredients = 
            [ мясо 400
            ; рис 0.5
            ; вода 1.0
            ; ``соли и переца по вкусу`` 
            ]
         ; recipe = 
                { steps = 
                    [ 60 -- "сварите мясной бульон" 
                    ; 10 ++  "нарежте овощи" 
                    ]
                }
          }    
          ; { name = "гороховый суп"
          ; ingredients = 
            [ мясо 500
            ; вода 2.5
            ; морковь 1.0
            ; лук 1.0
            ; ``подсолнечное масло`` 2.0
            ; ``соли и переца по вкусу`` 
            ]
         ; recipe = 
                { steps = 
                    [ 60 -- "сварите мясной бульон" 
                    ; 10 ++  "нарежте овощи" 
                    ]
                }
          }      
          ; { name = "пивной суп"
          ; ingredients = 
            [ печень 200
            ; пиво 0.5
            ; лук 1.0
            ; ``подсолнечное масло`` 1.0
            ; ``соли и переца по вкусу`` 
            ]
         ; recipe = 
                { steps = 
                    [ 5 -- "обжарьте печень с луком на растительном масле"
                    ; 10  -- "вскипетите пиво и добавьте печень с луком" 
                    ; 1   -- "посолите, поперчите" 
                    ]
                }
          }
        ]
